export const products = [
    {
        id: 1,
        name: "Футболка СИЛАВМЕСТЕ",
        price: 1800,
        category: "t-shirts",
        image: "/tshirt.jpg",
        colors: ["Темно-серый"],
        sizes: ["XS", "S", "M", "L", "XL", "XXL"],
        description:
            "Футболка DRP — базовая вещь, без которой невозможно представить лагерный гардероб. Удобный крой и мягкий трикотаж подойдут для любой активности: от линейки дискотеки. А главное — с ней ты носишь на себе память о лучших днях. Это не просто одежда, а символ твоей истории в лагере.",
        images: [
            "/tshirt.jpg"
        ],
    },
    {
        id: 2,
        name: "Худи СИЛАВМЕСТЕ",
        price: 3500,
        category: "hoodies",
        image: "/hoodie-4.jpg",
        colors: ["Черный", "Бежевый", "Розовый", "Синий"],
        sizes: ["S", "M", "L", "XL", "XXL"],
        description:
            "Классическое худи — для тех, кто хочет чувствовать себя как дома, где бы ни был. Невероятно мягкое и теплое, оно станет вашей любимой вещью в гардеробе. Современный крой подчеркивает силуэт, а качественные материалы гарантируют долговечность. Идеальна для прохладных вечеров и активного отдыха.",
        images: [
            "/hoodie-4.jpg",
            "/hoodie-2.jpg",
            "/hoodie-3.jpg",
            "/hoodie.jpg",
        ],
    },
    {
        id: 3,
        name: "Сумка СИЛАВМЕСТЕ",
        price: 2500,
        category: "accessories",
        image: "/bag.jpg",
        colors: ["Коричневый"],
        sizes: ["-"],
        description:
            "Функциональная сумка с элегантным дизайном готова к любым вашим путешествиям. Просторная и прочная, она сохранит ваши вещи в порядке. Воспоминания о лагерных вечерах будут с вами в каждом шаге. Эта сумка сочетает практичность и стиль. Отправляйтесь навстречу новым горизонтам.",
        images: [
            "/bag.jpg",
            "/bag-2.jpg",
        ],
    },
    {
        id: 4,
        name: "Бомбер СИЛАВМЕСТЕ",
        price: 4000,
        category: "bombers",
        image: "/bomber.jpg",
        colors: ["Темно-синий"],
        sizes: ["S", "M", "L", "XL"],
        description:
            "Стильный, легкий бомбер, словно яркий аккорд лагерной вечеринки, добавляет изысканности и тепла, оставаясь практичным спутником для активных дней или встреч с друзьями. Он соединяет комфорт с ноткой уверенности, воскрешая воспоминания о самых запоминающихся моментах под открытым небом.",
        images: [
            "/bomber.jpg"
        ],
    },
    {
        id: 5,
        name: "Жилетка СИЛАВМЕСТЕ",
        price: 6000,
        category: "jackets",
        image: "/jacket.jpg",
        colors: ["Коричневый"],
        sizes: ["S", "M", "L", "XL", "XXL"],
        description:
            "Легкая, универсальная жилетка, подобно надежному другу в походе, согревает без лишнего груза, идеально дополняя прогулки, путешествия или игры на свежем воздухе. Она пробуждает ностальгию по лагерным экспедициям, даря свободу движений и тепло дружеских встреч.",
        images: [
            "/jacket.jpg",
            "/jacket-2.jpg",
            "/jacket-3.jpg",
        ],
    },
    {
        id: 6,
        name: "Лонгслив СИЛАВМЕСТЕ",
        price: 2500,
        category: "longsleeves",
        image: "/longsleeve.jpg",
        colors: ["Белый"],
        sizes: ["S", "M", "L", "XL"],
        description:
            "Когда утро в лагере холодит кожу, а вечер зовет к костру, этот лонгслив становится вашей второй кожей. Мягкий, гибкий, он обнимает вас, пока вы слушаете треск поленьев или шорох листвы.",
        images: [
            "/longsleeve.jpg"
        ],
    },
    {
        id: 7,
        name: "Худи на молнии СИЛАВМЕСТЕ",
        price: 3000,
        category: "hoodies",
        image: "/zip-hoodie.jpg",
        colors: ["Красный", "Светло-серый"],
        sizes: ["S", "M", "L", "XL"],
        description:
            "Зип-зап — и вы в тепле! Это худи играет с погодой: застегнул — укрылся от ветра, расстегнул — поймал солнце. Идеально для тех, кто не сидит на месте. Легкое, но теплое, оно станет вашим верным спутником в любое время года. С ним вы всегда будете готовы к новым приключениям.",
        images: ["/zip-hoodie.jpg", "/zip-hoodie-2.jpg"],
    },
    {
        id: 8,
        name: "Свитшот СИЛАВМЕСТЕ",
        price: 3000,
        category: "sweatshirts",
        image: "/sweatshirt.jpg",
        colors: ["Голубой"],
        sizes: ["S", "M", "L", "XL"],
        description:
            "Свитшот, который согревает не только телом, но и душой. Он напоминает о лагерных вечерах у костра, когда тепло и уют важнее всего. Мягкий, стильный и универсальный, он станет вашим любимым спутником в прохладные дни. С ним вы всегда будете чувствовать себя комфортно и уверенно.",
        images: ["/sweatshirt.jpg"],
    },
        {
        id: 9,
        name: "Штаны СИЛАВМЕСТЕ",
        price: 2500,
        category: "pants",
        image: "/pants.jpg",
        colors: ["Красный", "Светло-серый"],
        sizes: ["S", "M", "L", "XL"],
        description:
            "Свободные, удобные штаны, созданные для неутомимых исследователей, сопровождают вас от энергичных походов по лесу до спокойных вечеров у огня, словно верный спутник лагерных дней. Они дарят комфорт и легкость, воскрешая в памяти безграничную свободу и радость движения под открытым небом.",
        images: ["/pants.jpg"],
    },
        {
        id: 10,
        name: "Панамка СИЛАВМЕСТЕ",
        price: 1200,
        category: "hats",
        image: "/panam.jpg",
        colors: ["Черный", "Темно-серый"],
        sizes: ["Единый размер"],
        description:
            "Панамка, в которой начинается лето. Защищает от солнца, добавляет стиля и напоминает о самых весёлых днях у костра и на линейке. Надень — и будто снова в лагере.",
        images: ["/panam.jpg"],
    },
]

export const categories = [
    { value: "all", label: "Все товары" },
    { value: "t-shirts", label: "Футболки" },
    { value: "hats", label: "Головые уборы" },
    { value: "hoodies", label: "Худи" },
    { value: "sweatshirts", label: "Свитшоты" },
    { value: "bombers", label: "Бомберы" },
    { value: "jackets", label: "Жилетки" },
    { value: "longsleeves", label: "Лонгсливы" },
    { value: "pants", label: "Штаны" },
    { value: "accessories", label: "Аксессуары" },
]